load-test/results/delivery-flow.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/delivery-flow.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 3m30s max duration (incl. graceful stop):
              * publisher: 1 looping VUs for 3m0s (gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   1% ] 1 VUs  0m01.0s/3m0s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   1% ] 1 VUs  0m02.0s/3m0s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   2% ] 1 VUs  0m03.0s/3m0s

running (0m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   2% ] 1 VUs  0m04.0s/3m0s

running (0m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   3% ] 1 VUs  0m05.0s/3m0s

running (0m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   3% ] 1 VUs  0m06.0s/3m0s

running (0m07.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   4% ] 1 VUs  0m07.0s/3m0s

running (0m08.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   4% ] 1 VUs  0m08.0s/3m0s

running (0m09.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   5% ] 1 VUs  0m09.0s/3m0s

running (0m10.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   6% ] 1 VUs  0m10.0s/3m0s

running (0m11.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   6% ] 1 VUs  0m11.0s/3m0s

running (0m12.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   7% ] 1 VUs  0m12.0s/3m0s

running (0m13.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   7% ] 1 VUs  0m13.0s/3m0s

running (0m14.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   8% ] 1 VUs  0m14.0s/3m0s

running (0m15.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
publisher   [   8% ] 1 VUs  0m15.0s/3m0s

running (0m16.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [   9% ] 1 VUs  0m16.0s/3m0s

running (0m17.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [   9% ] 1 VUs  0m17.0s/3m0s

running (0m18.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  10% ] 1 VUs  0m18.0s/3m0s

running (0m19.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  11% ] 1 VUs  0m19.0s/3m0s

running (0m20.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  11% ] 1 VUs  0m20.0s/3m0s

running (0m21.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  12% ] 1 VUs  0m21.0s/3m0s

running (0m22.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  12% ] 1 VUs  0m22.0s/3m0s

running (0m23.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  13% ] 1 VUs  0m23.0s/3m0s

running (0m24.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  13% ] 1 VUs  0m24.0s/3m0s

running (0m25.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  14% ] 1 VUs  0m25.0s/3m0s

running (0m26.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  14% ] 1 VUs  0m26.0s/3m0s

running (0m27.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  15% ] 1 VUs  0m27.0s/3m0s

running (0m28.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  16% ] 1 VUs  0m28.0s/3m0s

running (0m29.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  16% ] 1 VUs  0m29.0s/3m0s

running (0m30.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  17% ] 1 VUs  0m30.0s/3m0s

running (0m31.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
publisher   [  17% ] 1 VUs  0m31.0s/3m0s

running (0m32.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  18% ] 1 VUs  0m32.0s/3m0s

running (0m33.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  18% ] 1 VUs  0m33.0s/3m0s

running (0m34.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  19% ] 1 VUs  0m34.0s/3m0s

running (0m35.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  19% ] 1 VUs  0m35.0s/3m0s

running (0m36.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  20% ] 1 VUs  0m36.0s/3m0s

running (0m37.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  21% ] 1 VUs  0m37.0s/3m0s

running (0m38.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  21% ] 1 VUs  0m38.0s/3m0s

running (0m39.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  22% ] 1 VUs  0m39.0s/3m0s

running (0m40.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  22% ] 1 VUs  0m40.0s/3m0s

running (0m41.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  23% ] 1 VUs  0m41.0s/3m0s

running (0m42.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  23% ] 1 VUs  0m42.0s/3m0s

running (0m43.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  24% ] 1 VUs  0m43.0s/3m0s

running (0m44.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  24% ] 1 VUs  0m44.0s/3m0s

running (0m45.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  25% ] 1 VUs  0m45.0s/3m0s

running (0m46.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
publisher   [  26% ] 1 VUs  0m46.0s/3m0s

running (0m47.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  26% ] 1 VUs  0m47.0s/3m0s

running (0m48.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  27% ] 1 VUs  0m48.0s/3m0s

running (0m49.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  27% ] 1 VUs  0m49.0s/3m0s

running (0m50.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  28% ] 1 VUs  0m50.0s/3m0s

running (0m51.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  28% ] 1 VUs  0m51.0s/3m0s

running (0m52.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  29% ] 1 VUs  0m52.0s/3m0s

running (0m53.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  29% ] 1 VUs  0m53.0s/3m0s

running (0m54.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  30% ] 1 VUs  0m54.0s/3m0s

running (0m55.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  31% ] 1 VUs  0m55.0s/3m0s

running (0m56.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  31% ] 1 VUs  0m56.0s/3m0s

running (0m57.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  32% ] 1 VUs  0m57.0s/3m0s

running (0m58.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  32% ] 1 VUs  0m58.0s/3m0s

running (0m59.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  33% ] 1 VUs  0m59.0s/3m0s

running (1m00.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  33% ] 1 VUs  1m00.0s/3m0s

running (1m01.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  34% ] 1 VUs  1m01.0s/3m0s

running (1m02.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
publisher   [  34% ] 1 VUs  1m02.0s/3m0s

running (1m03.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  35% ] 1 VUs  1m03.0s/3m0s

running (1m04.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  36% ] 1 VUs  1m04.0s/3m0s

running (1m05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  36% ] 1 VUs  1m05.0s/3m0s

running (1m06.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  37% ] 1 VUs  1m06.0s/3m0s

running (1m07.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  37% ] 1 VUs  1m07.0s/3m0s

running (1m08.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  38% ] 1 VUs  1m08.0s/3m0s

running (1m09.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  38% ] 1 VUs  1m09.0s/3m0s

running (1m10.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  39% ] 1 VUs  1m10.0s/3m0s

running (1m11.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  39% ] 1 VUs  1m11.0s/3m0s

running (1m12.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  40% ] 1 VUs  1m12.0s/3m0s

running (1m13.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  41% ] 1 VUs  1m13.0s/3m0s

running (1m14.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  41% ] 1 VUs  1m14.0s/3m0s

running (1m15.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  42% ] 1 VUs  1m15.0s/3m0s

running (1m16.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  42% ] 1 VUs  1m16.0s/3m0s

running (1m17.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
publisher   [  43% ] 1 VUs  1m17.0s/3m0s

running (1m18.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  43% ] 1 VUs  1m18.0s/3m0s

running (1m19.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  44% ] 1 VUs  1m19.0s/3m0s

running (1m20.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  44% ] 1 VUs  1m20.0s/3m0s

running (1m21.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  45% ] 1 VUs  1m21.0s/3m0s

running (1m22.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  46% ] 1 VUs  1m22.0s/3m0s

running (1m23.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  46% ] 1 VUs  1m23.0s/3m0s

running (1m24.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  47% ] 1 VUs  1m24.0s/3m0s

running (1m25.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  47% ] 1 VUs  1m25.0s/3m0s

running (1m26.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  48% ] 1 VUs  1m26.0s/3m0s

running (1m27.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  48% ] 1 VUs  1m27.0s/3m0s

running (1m28.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  49% ] 1 VUs  1m28.0s/3m0s

running (1m29.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  49% ] 1 VUs  1m29.0s/3m0s

running (1m30.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  50% ] 1 VUs  1m30.0s/3m0s

running (1m31.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  51% ] 1 VUs  1m31.0s/3m0s

running (1m32.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
publisher   [  51% ] 1 VUs  1m32.0s/3m0s

running (1m33.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  52% ] 1 VUs  1m33.0s/3m0s

running (1m34.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  52% ] 1 VUs  1m34.0s/3m0s

running (1m35.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  53% ] 1 VUs  1m35.0s/3m0s

running (1m36.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  53% ] 1 VUs  1m36.0s/3m0s

running (1m37.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  54% ] 1 VUs  1m37.0s/3m0s

running (1m38.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  54% ] 1 VUs  1m38.0s/3m0s

running (1m39.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  55% ] 1 VUs  1m39.0s/3m0s

running (1m40.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  56% ] 1 VUs  1m40.0s/3m0s

running (1m41.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  56% ] 1 VUs  1m41.0s/3m0s

running (1m42.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  57% ] 1 VUs  1m42.0s/3m0s

running (1m43.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  57% ] 1 VUs  1m43.0s/3m0s

running (1m44.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  58% ] 1 VUs  1m44.0s/3m0s

running (1m45.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  58% ] 1 VUs  1m45.0s/3m0s

running (1m46.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  59% ] 1 VUs  1m46.0s/3m0s

running (1m47.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  59% ] 1 VUs  1m47.0s/3m0s

running (1m48.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
publisher   [  60% ] 1 VUs  1m48.0s/3m0s

running (1m49.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  61% ] 1 VUs  1m49.0s/3m0s

running (1m50.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  61% ] 1 VUs  1m50.0s/3m0s

running (1m51.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  62% ] 1 VUs  1m51.0s/3m0s

running (1m52.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  62% ] 1 VUs  1m52.0s/3m0s

running (1m53.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  63% ] 1 VUs  1m53.0s/3m0s

running (1m54.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  63% ] 1 VUs  1m54.0s/3m0s

running (1m55.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  64% ] 1 VUs  1m55.0s/3m0s

running (1m56.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  64% ] 1 VUs  1m56.0s/3m0s

running (1m57.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  65% ] 1 VUs  1m57.0s/3m0s

running (1m58.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  66% ] 1 VUs  1m58.0s/3m0s

running (1m59.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  66% ] 1 VUs  1m59.0s/3m0s

running (2m00.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  67% ] 1 VUs  2m00.0s/3m0s

running (2m01.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  67% ] 1 VUs  2m01.0s/3m0s

running (2m02.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  68% ] 1 VUs  2m02.0s/3m0s

running (2m03.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
publisher   [  68% ] 1 VUs  2m03.0s/3m0s

running (2m04.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  69% ] 1 VUs  2m04.0s/3m0s

running (2m05.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  69% ] 1 VUs  2m05.0s/3m0s

running (2m06.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  70% ] 1 VUs  2m06.0s/3m0s

running (2m07.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  71% ] 1 VUs  2m07.0s/3m0s

running (2m08.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  71% ] 1 VUs  2m08.0s/3m0s

running (2m09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  72% ] 1 VUs  2m09.0s/3m0s

running (2m10.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  72% ] 1 VUs  2m10.0s/3m0s

running (2m11.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  73% ] 1 VUs  2m11.0s/3m0s

running (2m12.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  73% ] 1 VUs  2m12.0s/3m0s

running (2m13.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  74% ] 1 VUs  2m13.0s/3m0s

running (2m14.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  74% ] 1 VUs  2m14.0s/3m0s

running (2m15.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  75% ] 1 VUs  2m15.0s/3m0s

running (2m16.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  76% ] 1 VUs  2m16.0s/3m0s

running (2m17.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  76% ] 1 VUs  2m17.0s/3m0s

running (2m18.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
publisher   [  77% ] 1 VUs  2m18.0s/3m0s

running (2m19.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  77% ] 1 VUs  2m19.0s/3m0s

running (2m20.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  78% ] 1 VUs  2m20.0s/3m0s

running (2m21.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  78% ] 1 VUs  2m21.0s/3m0s

running (2m22.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  79% ] 1 VUs  2m22.0s/3m0s

running (2m23.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  79% ] 1 VUs  2m23.0s/3m0s

running (2m24.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  80% ] 1 VUs  2m24.0s/3m0s

running (2m25.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  81% ] 1 VUs  2m25.0s/3m0s

running (2m26.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  81% ] 1 VUs  2m26.0s/3m0s

running (2m27.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  82% ] 1 VUs  2m27.0s/3m0s

running (2m28.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  82% ] 1 VUs  2m28.0s/3m0s

running (2m29.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  83% ] 1 VUs  2m29.0s/3m0s

running (2m30.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  83% ] 1 VUs  2m30.0s/3m0s

running (2m31.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  84% ] 1 VUs  2m31.0s/3m0s

running (2m32.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  84% ] 1 VUs  2m32.0s/3m0s

running (2m33.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  85% ] 1 VUs  2m33.0s/3m0s

running (2m34.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
publisher   [  86% ] 1 VUs  2m34.0s/3m0s

running (2m35.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  86% ] 1 VUs  2m35.0s/3m0s

running (2m36.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  87% ] 1 VUs  2m36.0s/3m0s

running (2m37.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  87% ] 1 VUs  2m37.0s/3m0s

running (2m38.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  88% ] 1 VUs  2m38.0s/3m0s

running (2m39.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  88% ] 1 VUs  2m39.0s/3m0s

running (2m40.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  89% ] 1 VUs  2m40.0s/3m0s

running (2m41.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  89% ] 1 VUs  2m41.0s/3m0s

running (2m42.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  90% ] 1 VUs  2m42.0s/3m0s

running (2m43.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  91% ] 1 VUs  2m43.0s/3m0s

running (2m44.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  91% ] 1 VUs  2m44.0s/3m0s

running (2m45.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  92% ] 1 VUs  2m45.0s/3m0s

running (2m46.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  92% ] 1 VUs  2m46.0s/3m0s

running (2m47.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  93% ] 1 VUs  2m47.0s/3m0s

running (2m48.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  93% ] 1 VUs  2m48.0s/3m0s

running (2m49.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
publisher   [  94% ] 1 VUs  2m49.0s/3m0s

running (2m50.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  94% ] 1 VUs  2m50.0s/3m0s

running (2m51.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  95% ] 1 VUs  2m51.0s/3m0s

running (2m52.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  96% ] 1 VUs  2m52.0s/3m0s

running (2m53.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  96% ] 1 VUs  2m53.0s/3m0s

running (2m54.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  97% ] 1 VUs  2m54.0s/3m0s

running (2m55.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  97% ] 1 VUs  2m55.0s/3m0s

running (2m56.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  98% ] 1 VUs  2m56.0s/3m0s

running (2m57.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  98% ] 1 VUs  2m57.0s/3m0s

running (2m58.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  99% ] 1 VUs  2m58.0s/3m0s

running (2m59.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [  99% ] 1 VUs  2m59.0s/3m0s

running (3m00.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher   [ 100% ] 1 VUs  3m00.0s/3m0s

running (3m01.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher ↓ [ 100% ] 1 VUs  3m0s

running (3m02.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher ↓ [ 100% ] 1 VUs  3m0s

running (3m03.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher ↓ [ 100% ] 1 VUs  3m0s

running (3m04.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher ↓ [ 100% ] 1 VUs  3m0s

running (3m05.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
publisher ↓ [ 100% ] 1 VUs  3m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    publish_and_deliver_ms
    ✓ 'p(95)<4000' p(95)=339.27ms


  █ TOTAL RESULTS 

    checks_total.......: 36      0.194555/s
    checks_succeeded...: 100.00% 36 out of 36
    checks_failed......: 0.00%   0 out of 36

    ✓ published 201
    ✓ drain delivered inline
    ✓ delivery visible and delivered

    CUSTOM
    publish_and_deliver_ms.........: avg=275.35ms min=239.7ms  med=261.74ms max=354.31ms p(90)=324.34ms p(95)=339.27ms

    HTTP
    http_req_duration..............: avg=196.82ms min=107.37ms med=184.34ms max=354.31ms p(90)=293.32ms p(95)=323.03ms
      { expected_response:true }...: avg=196.82ms min=107.37ms med=184.34ms max=354.31ms p(90)=293.32ms p(95)=323.03ms
    http_req_failed................: 0.00%  0 out of 24
    http_reqs......................: 24     0.129703/s

    EXECUTION
    iteration_duration.............: avg=15.41s   min=15.36s   med=15.38s   max=15.74s   p(90)=15.47s   p(95)=15.59s  
    iterations.....................: 12     0.064852/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 21 kB  115 B/s
    data_sent......................: 5.5 kB 30 B/s



running (3m05.0s), 0/1 VUs, 12 complete and 0 interrupted iterations
publisher ✓ [ 100% ] 1 VUs  3m0s